{
  "id": 1,
  "title": "The last bus to Fragrant hill",
  "author": "Sarah Blake",
  "date": "2024-10-31",
  "imageUrl": "https://encrypted-tbn0.gstatic.com/images?q=tbn:ANd9GcRs5QSgG-wiPwrC_Qq9rxor9mVGzYpsAqZarnT6QrDJuxCYDEipcYqaAhLq&s=10",
  "content": [
    "The Bus no 375 incident took place on the night of 14 November 1995 in Beijing, China. The incident is also known as The Bus 375 Beijing, The Midnight Bus, and The Last Bus to Fragrant Hills.",
    "Even today people in China get scared while talking about the incident of Bus No 375. Bus No 375 is still a mystery that has not been solved yet.",
    "On the night of 14 November 1995, Bus no 375 bus departed from Yuan Ming Huan's bus terminal and was to reach the city of Xiang Shan (Fragrant Hill).",
    "When the bus left Yuan Ming Huan, it was full of passengers, as people got off as they approached the different bus terminals.",
    "Bus no 375 bus was now about 7 stations away from Xiang Shan. The bus was empty and all the passengers got down, leaving only one driver and one lady conductor on the bus.",
    "The bus of route No 375 stops at a bus terminal from where a couple, an elderly woman and a young boy board the bus. There were now 6 people on the bus, 4 passengers and 2 crew members. The bus started running and it was now only 6 stations away from the destination.",
    "There was complete peace on the bus. The area through which the bus was passing was also secluded, due to which no other sound was heard except the sound of the bus engine.",
    "About 4 stations before the destination, the bus driver sees 2 people standing at the bus stop. The driver knew that he was also a passenger and he stopped the bus.",
    "These passengers enter through the back door of the bus. Two were visible when they were standing at the bus stop, but when they entered the bus, it was three people. The third person was in between the two, and it seemed that those two People were supporting the third one.",
    "These three people were wearing traditional clothes in China because their faces were not visible properly. The way these three people boarded the bus and saw them wearing strange clothes, the rest of the passengers sitting on the bus got scared.",
    "There was an atmosphere of fear in the bus that after some time the next station came, where the couple sitting on the bus had to get down. After a while, the bus stops at the station and the couple gets off the bus.",
    "The bus starts again towards its destination. Now there were 7 people on the bus, an elderly woman, a young boy, two crew members, and those three passengers. The old lady was sitting in the middle seat of the bus, the young boy was sitting in the seat immediately ahead of her and those three passengers were sitting in the back seat.",
    "The old lady looked back again and again at the three passengers, and every time she got scared to see them. After a while, the old lady gets up and starts scolding the young boy sitting in the front seat, you stole my purse.",
    "The boy said that he was sitting in the front seat, and how he could steal the purse. But the old lady did not listen and started scolding him loudly. Hearing the voice of the elderly woman, the bus conductor comes to her and asks what happened. The elderly lady says that this boy has stolen my purse. The boy says that I am sitting in front of her, so how can I steal her purse?",
    "Lady conductor explained a lot to the elderly lady that this young boy cannot steal her purse, your purse must have fallen somewhere. Even after much persuasion by the lady conductor, the old lady does not agree and says drop us both at the next station, I want to take this young boy to the police station. On reaching the next station, the driver stops the bus, both the elderly woman and the young boy get off the bus and the bus moves towards its destination.",
    "The young boy angrily tells the elderly woman that where is the police station here my last bus was also gone, now how will I go home? So the old lady says that there is no police station here and I didn't get off the bus to take you to the police station, but I had to save your life.",
    "The young boy says what happened, why did you have to save my life? The elderly woman says that three passengers were sitting behind, her who looked strange. I was watching them continuously, and suddenly the wind came which started blowing their clothes. When their clothes were flying, I saw that they had no legs. At first, I thought that this is my illusion after looking carefully I came to know that those people are not human but something else.",
    "I thought they were ghosts, and I have to save you and my life from them. For which I falsely accused you of stealing a purse so that we can get off the bus and no one suspects us, especially those three passengers.",
    "The young boy said, If it was like that, why didn't you talk to the crew members of the bus? The elderly lady says that I talked to the lady conductor, but she said that this is only your illusion, not anything else.",
    "Does the young boy say what to do now? So the elderly woman says that we should go to the police station and tell all this to the police. After going to the police station, they both told the whole thing to the police. But, The police did not write the report and told them that \"you guys should go home now, we will take some action regarding this matter\".",
    "Both the elderly woman and the young boy went to their homes. On the morning of November 15, Xiang Shan Bus Terminal officers learned that the Bus No 375 bus from Yuan Ming Yuan to Xiang Shan had not yet reached the bus terminal. Xiang Shan Bus Terminal officials learn that the bus was last seen at the fourth station before its destination.",
    "Even after a lot of searching of the bus, nothing was found of the bus and any crew member, after this the officials wrote the missing report of the bus at the police station. Xiang Shan's police officers report the disappearance of this bus to every police station through which this bus passed.",
    "When the missing report of bus number 375 reached the police station on the night of November 14, the old lady and the youth had gone to file the report. When the officer of that station came to know, he immediately called that old lady and young boy to the police station and recorded their statement. Sometime Later the missing news of this bus no 375 spread all over Beijing.",
    "The old lady gives an interview on a TV channel in which she narrates the story of the incident Which happened on Bus no 375 on the night of November 14.",
    "On 16 November, this bus no 375 was taken out from a river, about 100 km away from the station where the old lady and the young boy got down. A total of 5 dead bodies were found on this bus.",
    "When the bus was being pulled from the river, the police and doctors were all presents there. When those five dead bodies were taken out, then everyone was stunned to see those dead bodies. Because out of the five dead bodies, the dead bodies of bus crew members were right. But the dead bodies of those three passengers were badly decomposed.",
    "After doing more research about this incident, many such mysterious questions have arisen, whose answer has not been found to date.",
    "The Mysterious Questions of Bus No 375",
    "Who were the mysterious three passengers on the bus?",
    "It was only two days since those three passengers were dead, but why were their bodies so rotten?",
    "Were those three passengers ghosts?",
    "How did the bus reach the next 100Km even though there was no fuel in the bus?",
    "How did the blood get into the fuel tank of the bus?",
    "Why did that bus not appear in the camera of any bus stop?",
    "After this incident, people in Beijing stopped sitting on route number 375. This continued for several days but as time passed people forgot this incident. But some people are still afraid to talk about this incident.\n"
  ],
  "nextPart": "2",
  "previousPart": "1",
}
