{
  "id": 9,
  "title": "The creepy urban legend of Kisaragi train station of Japan.",
  "author": "--------",
  "date": "2024-10-31",
  "imageUrl": "/api/placeholder/800/400",
  "content": [
    "The following story was posted on the 2chan forums in real time. The original poster, who went by the name Hasumi, kept readers up-to-date on her strange experience as it was happening, and received advice from them as to what to do. The following is what happened.",
    "Hasumi\nIt might just be my imagination, but do you mind if I talk about something?",
    "2chan\nSure, go ahead. What happened?",
    "Hasumi\nI just got on the train, but something’s off.",
    "2chan\nOkay.",
    "Hasumi\nIt’s the train I always take to and from work, but it hasn’t stopped at any stations for about 20 minutes now. It always stops every five minutes, or at most every seven or eight, but it hasn’t stopped at all. There are currently five other people on board, but they’re all asleep.",
    "2chan\nYou haven’t gotten off the train yet, have you? You didn’t get on the express by mistake?",
    "Hasumi\nYeah, like you said, it’s possible I got on the wrong train. I’ll wait it out just a little longer. If anything else weird happens, I’ll come back again.",
    "2chan\nFirst of all, why don’t you go to the front carriage and see the conductor? If he had an epileptic fit or something that would be terrible. Go and check on him!",
    "Hasumi\nIt still doesn’t look like we’re going to stop anywhere, so I’ll go and have a look.",
    "The blinds or something are covering the window, so I can’t see the driver. I’m on a private railway in Shizuoka Prefecture.",
    "2chan\nDid you knock on the window?",
    "Hasumi\nI did, but there was no answer.",
    "2chan\nCan you see outside? Can you see the names of passing stations or anything?",
    "Hasumi\nAfter leaving the tunnel the train has started to slow down a little. We don’t usually pass through a tunnel though. It’s the train from Shin-Hamamatsu Station.",
    "It looks like we’re about to stop.",
    "2chan\nYou’re not gonna get off, are you?",
    "Hasumi\nWe’re stopped at Kisaragi Station, but I wonder if I should get off? I’ve never seen or heard of this station before.",
    "2chan\nYou should get off.",
    "No, you should stay on until the last stop.",
    "I mean, the train should’ve started moving again by now, shouldn’t it?",
    "Hasumi, what time did you get on the train?",
    "Hasumi\nI got off. The station is empty. I got on the train around 11.40 pm, I think.",
    "2chan\nI did a search for Kisaragi Station, but nothing came up… And hang on, your train’s been running for an hour now? Alright, I’m off to take a bath.",
    "I looked for Kisaragi Station as well, but there’s nothing here.",
    "Hasumi\nI think I should go back. I’ve been looking for a timetable but I can’t find anything. The train is still stopped so I wonder if it would be safer to just get back on? Well, while I was writing that I already got back on board.",
    "2chan\nAre there any buildings nearby that look like they might have people? It’s cold out there, so be careful.",
    "Hasumi\nI’m gonna leave the station and see if I can find a taxi. Thanks.",
    "2chan\nThat’s a good idea. Be careful.",
    "I’m doubtful that you’ll easily be able to find a taxi at an empty station after the last trains have already run.",
    "And it looks like Hasumi’s become a resident of the 2D world.",
    "Hasumi\nThere’s nothing here, let alone a taxi. What should I do?",
    "2chan\nGo see the station attendant or a nearby police box!",
    "Shouldn’t you call 110 for now?",
    "Why don’t you call the taxi company?",
    "All you can do at this point is go to the nearest convenience store.",
    "If there’s a public phone nearby, you should look up the number of the taxi company and give them a call.",
    "Hasumi\nI call my parents to come and pick me up but they don’t know where Kisaragi Station is. They said they’d look it up on the map and then come to get me, but I’m kinda scared.",
    "2chan\nWhat happened to the others on the train? Were you the only one who got off?",
    "Hasumi, I also tried to find Kisaragi Station on the internet, but there’s nothing here. You said you were near the Shin-Hamamatsu area, right? I’ll see if I can find anything on Yahoo.",
    "Hasumi\nI went to look for a public phone but there aren’t any. The other passengers didn’t get off, so I’m alone right now. The station name is most definitely Kisaragi Station.",
    "2chan\nThere’s a chance you’ll find a public phone off the station grounds.",
    "Why don’t you try leaving the station?",
    "I just did a bit of investigating right now, and the kanji for ‘oni’ (demon) can also be read as ‘kisaragi,’ right…?",
    "So you mean ‘Demon Station’…? That’s terrifying.",
    "Are you a video game nerd? When I googled it, I found a video game.",
    "Write down the previous and next stations from Kisaragi Station. Don’t say there’s nothing written there.",
    "Hasumi\nWhat game are you talking about? There are no previous or next stations written here.",
    "2chan\nTry walking back home along the tracks.",
    "If you start running now, you can probably catch up with the train!",
    "It’s a station, so there has to be people living around there.",
    "Hasumi\nYeah, that’s right. I was panicking, so I didn’t even notice. I’ll follow the tracks back and wait for my parents to call. I tried looking before in the Town Information part of I Mode in my phone, but it came up with some kind of error. I just wanna go home.",
    "2chan\nWhether it’s a joke or not, I’m gonna work towards solving this seriously.",
    "Hasumi\nThere really is nothing around here. All I can see are grasslands and mountains. But if I follow the railway tracks, I think I can get home, so I’ll do my best. Thank you. You might think it’s all just one big joke, but can I come back if I run into any other problems?",
    "2chan\nOf course. At any rate, take care.",
    "Of course. Just be careful your phone doesn’t die. It’s your lifeline right now.",
    "Don’t start walking in the wrong direction. And be careful inside the tunnel.",
    "Can a phone even get reception in an area with nothing around? I think it would be better if you don’t move from the station…",
    "All alone at an unmanned station on a cold night. The lights will probably turn off soon and it’ll be dark.",
    "The railway tracks are an even darker trap. There’s a tunnel after that too, right?",
    "And yet, it would probably be safer to spend the night at the station…",
    "This is terribly risky.",
    "Hasumi\nMy father called. He had a lot of questions, but in the end we have no idea where I am, so he told me to call 110. I don’t really want to, but I’m going to give the police a call and see if they can help me…",
    "2chan\nI think it would be easier for you to move around once it gets brighter…",
    "Could you really wait there all alone at night? In some strange, unfamiliar place…",
    "Could you pass through the tunnel all alone at night? On some strange, unfamiliar railway track…",
    "So could you keep walking through some unfamiliar street at night in the cold?",
    "Hasumi\nI tried explaining my situation the best I could to the police, but they thought it was a joke and got angry at me. I was so scared that I ended up apologising to them…",
    "2chan\nWhy did you apologise? You should call it a night. Go wait at the station for the first train.",
    "What’s it like around the station? Is there anything there?",
    "Hasumi\nI can hear what sounds like the beating of drums coming from far away, mixed with the sound of a ringing bell. Honestly, I don’t know what I should do anymore.",
    "2chan\nHasumi, you need to get back to the station. It’s best to return to where you were in the first place when you get lost.",
    "It’s about to start…",
    "Drums and bells…?",
    "It’s probably just a festival.",
    "Hasumi\nYou might think I’m lying, but I’m so scared, I can’t look back. I wanna go back to the station, but I can’t turn back.",
    "2chan\nRun. Whatever you do, don’t look back.",
    "You can’t look back at the station! You’ll be taken away. Just run towards the tunnel, right now! It should be closer than you think.",
    "Hasumi\nSomeone just yelled out from behind me. “Hey, you can’t walk along the railway track, it’s dangerous!” I thought it might be the station attendant, so I turned around, and about 10 metres away there was the old guy with one leg standing there. Then he disappeared. I’m so scared, I can’t move.",
    "2chan\nI said don’t look back. Just run.",
    "Calm down and listen to what I have to say. Try going towards the sound of the drums. There should be people there.",
    "Just where are you trying to send Hasumi?",
    "That’s not it at all, Hasumi is about to be taken away. That’s why I’m saying, if she can, she should go back.",
    "How come you could you tell it was an old guy with just one leg?",
    "…because it’s an old guy with just one leg?",
    "It’s probably some guy that was hit by a train and lost his leg and then died.",
    "Hasumi\nI can’t walk anymore, but I also can’t run. The sound of the drums is getting closer.",
    "2chan\nJust wait for morning. Once it gets brighter, it won’t be so scary.",
    "You should have gotten back on the train.",
    "Hasumi\nI’m still alive. I fell over and I’m bleeding, but I’m still holding onto the heel I broke. I don’t want to die yet.",
    "2chan\nWell, it’s not like things were going to get better if you stayed in the one spot, anyway.",
    "I think you’ll be fine if you can get through the tunnel, anyhow. When you pass through, let us know and get some help.",
    "Hasumi\nI called home. My dad said he’d call the police for me, but the sound is getting closer and closer.",
    "2chan\nWell, let’s just pray that sound isn’t the sound of an approaching train. Having said that, it’s probably too late for that now.",
    "Hasumi\nI did my best and I’m somehow in front of the tunnel now. The name says Isanuki. The sound is getting closer, so I’m gonna gather up all my courage and try to get through. I’ll post again once I get through safely.",
    "2chan\nGood luck.",
    "This is the end. The train and the station are gone. You can’t go back. There’s no-one to follow. The sound you hear is a phantom of your own past. Run towards the tunnel. If you stop, you’ll just be stuck between worlds.",
    "Hasumi\nI’ve exited the tunnel. Someone’s standing just ahead of me. Looks like doing what you guys suggested was the right answer. Thank you. I’m probably gonna be mistaken for a monster, my face is a mess of tears.",
    "2chan\nHasumi, wait! Don’t move!",
    "Stop! It’s dangerous!",
    "Who would be standing there at such a time? It’s too suspicious…",
    "Hasumi\nSorry for making you all worry. The person was very kind and said they would take me to the closest station. Apparently there’s a business hotel or something there. Everyone, thank you so much.",
    "2chan\nHasumi. There’s something I want to ask you, so please answer. Where are you? Can you ask that kind person the place name?",
    "Are they really kind? They could be scarier than what’s going on here, you know.",
    "Yeah, maybe. Anywhere, where the hell are you?!",
    "That person is dangerous!! Why is someone on the railway tracks at this time of night? They must have run into you while disposing of a dead body or something! Run!!",
    "Hasumi\nI asked where we are, but he just said ‘Hina.’ There’s no way that could be true though.",
    "2chan\nHasumi, get out of the car!",
    "I’m sorry, Kasumi. Where is Hina?",
    "What a strange story. So at this particular time some suspicious old guy just happened to be there to pick up a girl walking along the railway tracks…? What was he doing?",
    "Hasumi\nWe’ve started getting closer to the mountains now. I don’t think there’s anywhere for the car to stop, and he’s stopped talking to me entirely.",
    "2chan\nThere’s no reason for even a strange old dude to be up at this time.",
    "Maybe he’s not talking to you anymore because you’re always on your phone?",
    "Hasumi, you’re in danger. Did you tell your parents to come and get you from the tunnel?",
    "Hasumi. Call 110. This might be the last time you ever write anything.",
    "Hasumi\nMy battery’s about to die. Things are looking strange, so I’m gonna try to run the first chance I get. He’s been muttering about something I can’t understand for a while now. Just so I’m ready when needs be, I’m going to make this my last post for now.",
    "※ After this post, Hasumi was never heard from again."
  ],
  "nextPart": "Null",
  "previousPart": "Null"
}
